Report 2/C142/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
	(0 1 -0.5)
	(1 1 -0.5)
	(1 -1 -0.5)
	(2 -1 -0.5)
	(2 1 -0.5)
	(3 1 -0.5)
	(3 2 -0.5)
	(2 2 -0.5)
	(1 2 -0.5)
	(0 2 -0.5)
	(0 3 -0.5)
	(1 3 -0.5)
	(2 3 -0.5)
	(3 3 -0.5)
	(0 1 0.5)
	(1 1 0.5)
	(1 -1 0.5)
	(2 -1 0.5)
	(2 1 0.5)
	(3 1 0.5)
	(3 2 0.5)
	(2 2 0.5)
	(1 2 0.5)
	(0 2 0.5)
	(0 3 0.5)
	(1 3 0.5)
	(2 3 0.5)
	(3 3 0.5)

);


blocks
(
    hex (0 1 8 9 14 15 22 23) (50 50 1) edgeGrading (0.5 0.5 0.5 0.5 10 10 10 10 1 1 1 1)

    hex (1 4 7 8 15 18 21 22) (100 50 1) edgeGrading (1 1 1 1 10 10 10 10 1 1 1 1)

    hex (2 3 4 1 16 17 18 15) (100 200 1) edgeGrading (1 1 1 1 0.2 0.2 0.2 0.2 1 1 1 1)

    hex (4 5 6 7 18 19 20 21) (50 50 1) edgeGrading (2 2 2 2 10 10 10 10 1 1 1 1)

    hex (9 8 11 10 23 22 25 24) (50 50 1) edgeGrading (0.5 0.5 0.5 0.5 0.1 0.1 0.1 0.1 1 1 1 1)

    hex (8 7 12 11 22 21 26 25) (100 50 1) edgeGrading (1 1 1 1 0.1 0.1 0.1 0.1 1 1 1 1)

    hex (7 6 13 12 21 20 27 26) (50 50 1) edgeGrading (2 2 2 2 0.1 0.1 0.1 0.1 1 1 1 1)

);

edges
(
);

boundary
(
    velocityInlet
    {
        type patch;
        faces
        (
            (0 14 23 9)
	    (9 23 24 10)
        );
    }
    pressureOutlet
    {
        type patch;
        faces
        (
            (5 19 20 6)
	    (6 20 27 13)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (10 11 25 24)
            (11 12 26 25)
	    (12 13 27 26)
	    (0 1 15 14)
	    (2 16 15 1)
	    (2 3 17 16)
	    (3 17 18 4)
            (4 5 19 18)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
	    (0 1 8 9)
	    (1 4 7 8)
	    (2 3 4 1)
     	    (4 5 6 7)
	    (9 8 11 10)
	    (8 7 12 11)
	    (7 6 13 12)
	    (14 15 22 23)
	    (15 18 21 22)
	    (16 17 18 15)
	    (18 19 20 21)
	    (23 22 25 24)
	    (22 21 26 25)
	    (21 20 27 26)
        );
    }
);
